Revit 2027 API
ElectricalSetting.GetCircuitNamingSchemeSettings Method
 Gets the circuit naming scheme settings of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CircuitNamingSchemeSettings GetCircuitNamingSchemeSettings(
	Document cda
)
Public Shared Function GetCircuitNamingSchemeSettings (
	cda As Document
) As CircuitNamingSchemeSettings
public:
static CircuitNamingSchemeSettings^ GetCircuitNamingSchemeSettings(
	Document^ cda
)
static member GetCircuitNamingSchemeSettings :
        cda : Document -> CircuitNamingSchemeSettings
Parameters
cda Document
 The document.
Return Value
CircuitNamingSchemeSettings
 The circuit naming scheme settings of the project.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace